zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f5xx.h
/******************  Bit definition for DMA_CTR2 register  *******************/
#define DMA_CTR2_REQSEL_Pos                 (0U)
#define DMA_CTR2_REQSEL_Msk                 (0xFFUL << DMA_CTR2_REQSEL_Pos)         /*!< 0x000000FF */
#define DMA_CTR2_REQSEL                     DMA_CTR2_REQSEL_Msk                     /*!< DMA hardware request selection */
#define DMA_CTR2_SWREQ_Pos                  (9U)
#define DMA_CTR2_SWREQ_Msk                  (0x1UL << DMA_CTR2_SWREQ_Pos)           /*!< 0x00000200 */
#define DMA_CTR2_SWREQ                      DMA_CTR2_SWREQ_Msk                      /*!< Software request               */
#define DMA_CTR2_DREQ_Pos                   (10U)
#define DMA_CTR2_DREQ_Msk                   (0x1UL << DMA_CTR2_DREQ_Pos)            /*!< 0x00000400 */
#define DMA_CTR2_DREQ                       DMA_CTR2_DREQ_Msk                       /*!< Destination hardware request   */
#define DMA_CTR2_BREQ_Pos                   (11U)
#define DMA_CTR2_BREQ_Msk                   (0x1UL << DMA_CTR2_BREQ_Pos)            /*!< 0x00000800 */
#define DMA_CTR2_BREQ                       DMA_CTR2_BREQ_Msk                       /*!< Block hardware request         */
#define DMA_CTR2_PFREQ_Pos                  (12U)
#define DMA_CTR2_PFREQ_Msk                  (0x1UL << DMA_CTR2_PFREQ_Pos)           /*!< 0x00001000 */
#define DMA_CTR2_PFREQ                      DMA_CTR2_PFREQ_Msk                      /*!< Block hardware request */
#define DMA_CTR2_TRIGM_Pos                  (14U)
#define DMA_CTR2_TRIGM_Msk                  (0x3UL << DMA_CTR2_TRIGM_Pos)           /*!< 0x0000C000 */
#define DMA_CTR2_TRIGM                      DMA_CTR2_TRIGM_Msk                      /*!< Trigger mode                   */
#define DMA_CTR2_TRIGM_0                    (0x1UL << DMA_CTR2_TRIGM_Pos)           /*!< Bit 0 */
#define DMA_CTR2_TRIGM_1                    (0x2UL << DMA_CTR2_TRIGM_Pos)           /*!< Bit 1 */
#define DMA_CTR2_TRIGSEL_Pos                (16U)
#define DMA_CTR2_TRIGSEL_Msk                (0x7FUL << DMA_CTR2_TRIGSEL_Pos)        /*!< 0x007F0000 */
#define DMA_CTR2_TRIGSEL                    DMA_CTR2_TRIGSEL_Msk                    /*!< Trigger event input selection  */
#define DMA_CTR2_TRIGPOL_Pos                (24U)
#define DMA_CTR2_TRIGPOL_Msk                (0x3UL << DMA_CTR2_TRIGPOL_Pos)         /*!< 0x03000000 */
#define DMA_CTR2_TRIGPOL                    DMA_CTR2_TRIGPOL_Msk                    /*!< Trigger event polarity         */
#define DMA_CTR2_TRIGPOL_0                  (0x1UL << DMA_CTR2_TRIGPOL_Pos)         /*!< Bit 0 */
#define DMA_CTR2_TRIGPOL_1                  (0x2UL << DMA_CTR2_TRIGPOL_Pos)         /*!< Bit 1 */
#define DMA_CTR2_TCEM_Pos                   (30U)
#define DMA_CTR2_TCEM_Msk                   (0x3UL << DMA_CTR2_TCEM_Pos)            /*!< 0xC0000000 */
#define DMA_CTR2_TCEM                       DMA_CTR2_TCEM_Msk                       /*!< Transfer complete event mode   */
#define DMA_CTR2_TCEM_0                     (0x1UL << DMA_CTR2_TCEM_Pos)            /*!< Bit 0 */
#define DMA_CTR2_TCEM_1                     (0x2UL << DMA_CTR2_TCEM_Pos)            /*!< Bit 1 */

/******************  Bit definition for DMA_CBR1 register  *******************/
#define DMA_CBR1_BNDT_Pos                   (0U)
#define DMA_CBR1_BNDT_Msk                   (0xFFFFUL << DMA_CBR1_BNDT_Pos)         /*!< 0x0000FFFF */
#define DMA_CBR1_BNDT                       DMA_CBR1_BNDT_Msk                       /*!< Block number of data bytes to transfer from the source */
#define DMA_CBR1_BRC_Pos                    (16U)
#define DMA_CBR1_BRC_Msk                    (0x7FFUL << DMA_CBR1_BRC_Pos)           /*!< 0x07FF0000 */
#define DMA_CBR1_BRC                        DMA_CBR1_BRC_Msk                        /*!< Block repeat counter                                   */
#define DMA_CBR1_SDEC_Pos                   (28U)
#define DMA_CBR1_SDEC_Msk                   (0x1UL << DMA_CBR1_SDEC_Pos)            /*!< 0x10000000 */
#define DMA_CBR1_SDEC                       DMA_CBR1_SDEC_Msk                       /*!< Source address decrement                               */
#define DMA_CBR1_DDEC_Pos                   (29U)
#define DMA_CBR1_DDEC_Msk                   (0x1UL << DMA_CBR1_DDEC_Pos)            /*!< 0x20000000 */
#define DMA_CBR1_DDEC                       DMA_CBR1_DDEC_Msk                       /*!< Destination address decrement                          */
#define DMA_CBR1_BRSDEC_Pos                 (30U)
#define DMA_CBR1_BRSDEC_Msk                 (0x1UL << DMA_CBR1_BRSDEC_Pos)          /*!< 0x40000000 */
#define DMA_CBR1_BRSDEC                     DMA_CBR1_BRSDEC_Msk                     /*!< Block repeat source address decrement                  */
#define DMA_CBR1_BRDDEC_Pos                 (31U)
#define DMA_CBR1_BRDDEC_Msk                 (0x1UL << DMA_CBR1_BRDDEC_Pos)          /*!< 0x80000000 */
#define DMA_CBR1_BRDDEC                     DMA_CBR1_BRDDEC_Msk                     /*!< Block repeat destination address decrement             */

/******************  Bit definition for DMA_CSAR register  ********************/
#define DMA_CSAR_SA_Pos                     (0U)
#define DMA_CSAR_SA_Msk                     (0xFFFFFFFFUL << DMA_CSAR_SA_Pos)       /*!< 0xFFFFFFFF */
#define DMA_CSAR_SA                         DMA_CSAR_SA_Msk                         /*!< Source Address */

/******************  Bit definition for DMA_CDAR register  *******************/
#define DMA_CDAR_DA_Pos                     (0U)
#define DMA_CDAR_DA_Msk                     (0xFFFFFFFFUL << DMA_CDAR_DA_Pos)       /*!< 0xFFFFFFFF */
#define DMA_CDAR_DA                         DMA_CDAR_DA_Msk                         /*!< Destination address */

/******************  Bit definition for DMA_CTR3 register  *******************/
#define DMA_CTR3_SAO_Pos                    (0U)
#define DMA_CTR3_SAO_Msk                    (0x1FFFUL << DMA_CTR3_SAO_Pos)          /*!< 0x00001FFF */
#define DMA_CTR3_SAO                        DMA_CTR3_SAO_Msk                        /*!< Source address offset increment      */
#define DMA_CTR3_DAO_Pos                    (16U)
#define DMA_CTR3_DAO_Msk                    (0x1FFFUL << DMA_CTR3_DAO_Pos)          /*!< 0x1FFF0000 */
#define DMA_CTR3_DAO                        DMA_CTR3_DAO_Msk                        /*!< Destination address offset increment */

/******************  Bit definition for DMA_CBR2 register  *******************/
#define DMA_CBR2_BRSAO_Pos                  (0U)
#define DMA_CBR2_BRSAO_Msk                  (0xFFFFUL << DMA_CBR2_BRSAO_Pos)        /*!< 0x0000FFFF */
#define DMA_CBR2_BRSAO                      DMA_CBR2_BRSAO_Msk                      /*!< Block repeated source address offset      */
#define DMA_CBR2_BRDAO_Pos                  (16U)
#define DMA_CBR2_BRDAO_Msk                  (0xFFFFUL << DMA_CBR2_BRDAO_Pos)        /*!< 0xFFFF0000 */
#define DMA_CBR2_BRDAO                      DMA_CBR2_BRDAO_Msk                      /*!< Block repeated destination address offset */

/******************  Bit definition for DMA_CLLR register  *******************/
#define DMA_CLLR_LA_Pos                     (2U)
#define DMA_CLLR_LA_Msk                     (0x3FFFUL << DMA_CLLR_LA_Pos)           /*!< 0x0000FFFC */
#define DMA_CLLR_LA                         DMA_CLLR_LA_Msk                         /*!< Pointer to the next linked-list data structure */
#define DMA_CLLR_ULL_Pos                    (16U)
#define DMA_CLLR_ULL_Msk                    (0x1UL << DMA_CLLR_ULL_Pos)             /*!< 0x00010000 */
#define DMA_CLLR_ULL                        DMA_CLLR_ULL_Msk                        /*!< Update link address register from memory       */
#define DMA_CLLR_UB2_Pos                    (25U)
#define DMA_CLLR_UB2_Msk                    (0x1UL << DMA_CLLR_UB2_Pos)             /*!< 0x02000000 */
#define DMA_CLLR_UB2                        DMA_CLLR_UB2_Msk                        /*!< Update block register 2 from memory            */
#define DMA_CLLR_UT3_Pos                    (26U)
#define DMA_CLLR_UT3_Msk                    (0x1UL << DMA_CLLR_UT3_Pos)             /*!< 0x04000000 */
#define DMA_CLLR_UT3                        DMA_CLLR_UT3_Msk                        /*!< Update transfer register 3 from SRAM           */
#define DMA_CLLR_UDA_Pos                    (27U)
#define DMA_CLLR_UDA_Msk                    (0x1UL << DMA_CLLR_UDA_Pos)             /*!< 0x08000000 */
#define DMA_CLLR_UDA                        DMA_CLLR_UDA_Msk                        /*!< Update destination address register from SRAM  */
#define DMA_CLLR_USA_Pos                    (28U)
#define DMA_CLLR_USA_Msk                    (0x1UL << DMA_CLLR_USA_Pos)             /*!< 0x10000000 */
#define DMA_CLLR_USA                        DMA_CLLR_USA_Msk                        /*!< Update source address register from SRAM       */
#define DMA_CLLR_UB1_Pos                    (29U)
#define DMA_CLLR_UB1_Msk                    (0x1UL << DMA_CLLR_UB1_Pos)             /*!< 0x20000000 */
#define DMA_CLLR_UB1                        DMA_CLLR_UB1_Msk                        /*!< Update block register 1 from SRAM              */
#define DMA_CLLR_UT2_Pos                    (30U)
#define DMA_CLLR_UT2_Msk                    (0x1UL << DMA_CLLR_UT2_Pos)             /*!< 0x40000000 */
#define DMA_CLLR_UT2                        DMA_CLLR_UT2_Msk                        /*!< Update transfer register 2 from SRAM           */
#define DMA_CLLR_UT1_Pos                    (31U)
#define DMA_CLLR_UT1_Msk                    (0x1UL << DMA_CLLR_UT1_Pos)             /*!< 0x80000000 */
#define DMA_CLLR_UT1                        DMA_CLLR_UT1_Msk                        /*!< Update transfer register 1 from SRAM           */

/******************************************************************************/
/*                                                                            */
/*                         AHB Master DMA2D Controller (DMA2D)                */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for DMA2D_CR register  ******************/
#define DMA2D_CR_START_Pos                  (0U)
#define DMA2D_CR_START_Msk                  (0x1UL << DMA2D_CR_START_Pos)           /*!< 0x00000001 */
#define DMA2D_CR_START                      DMA2D_CR_START_Msk                      /*!< Start transfer                          */
#define DMA2D_CR_SUSP_Pos                   (1U)
#define DMA2D_CR_SUSP_Msk                   (0x1UL << DMA2D_CR_SUSP_Pos)            /*!< 0x00000002 */
#define DMA2D_CR_SUSP                       DMA2D_CR_SUSP_Msk                       /*!< Suspend transfer                        */
#define DMA2D_CR_ABORT_Pos                  (2U)
#define DMA2D_CR_ABORT_Msk                  (0x1UL << DMA2D_CR_ABORT_Pos)           /*!< 0x00000004 */
#define DMA2D_CR_ABORT                      DMA2D_CR_ABORT_Msk                      /*!< Abort transfer                          */
#define DMA2D_CR_LOM_Pos                    (6U)
#define DMA2D_CR_LOM_Msk                    (0x1UL << DMA2D_CR_LOM_Pos)             /*!< 0x00000040 */
#define DMA2D_CR_LOM                        DMA2D_CR_LOM_Msk                        /*!< Line offset mode                        */
#define DMA2D_CR_MODE_Pos                   (16U)
#define DMA2D_CR_MODE_Msk                   (0x7UL << DMA2D_CR_MODE_Pos)            /*!< 0x00070000 */
#define DMA2D_CR_MODE                       DMA2D_CR_MODE_Msk                       /*!< DMA2D Mode                              */
#define DMA2D_CR_MODE_0                     (0x1UL << DMA2D_CR_MODE_Pos)            /*!< 0x00010000 */
#define DMA2D_CR_MODE_1                     (0x2UL << DMA2D_CR_MODE_Pos)            /*!< 0x00020000 */
#define DMA2D_CR_MODE_2                     (0x4UL << DMA2D_CR_MODE_Pos)            /*!< 0x00040000 */

/********************  Bit definition for DMA2D_ISR register  *****************/
#define DMA2D_ISR_TEIF_Pos                  (0U)
#define DMA2D_ISR_TEIF_Msk                  (0x1UL << DMA2D_ISR_TEIF_Pos)           /*!< 0x00000001 */
#define DMA2D_ISR_TEIF                      DMA2D_ISR_TEIF_Msk                      /*!< Transfer Error Interrupt Flag         */
#define DMA2D_ISR_TCIF_Pos                  (1U)
#define DMA2D_ISR_TCIF_Msk                  (0x1UL << DMA2D_ISR_TCIF_Pos)           /*!< 0x00000002 */
#define DMA2D_ISR_TCIF                      DMA2D_ISR_TCIF_Msk                      /*!< Transfer Complete Interrupt Flag      */
#define DMA2D_ISR_TWIF_Pos                  (2U)
#define DMA2D_ISR_TWIF_Msk                  (0x1UL << DMA2D_ISR_TWIF_Pos)           /*!< 0x00000004 */
#define DMA2D_ISR_TWIF                      DMA2D_ISR_TWIF_Msk                      /*!< Transfer Watermark Interrupt Flag     */
#define DMA2D_ISR_CAEIF_Pos                 (3U)
#define DMA2D_ISR_CAEIF_Msk                 (0x1UL << DMA2D_ISR_CAEIF_Pos)          /*!< 0x00000008 */
#define DMA2D_ISR_CAEIF                     DMA2D_ISR_CAEIF_Msk                     /*!< CLUT Access Error Interrupt Flag      */
#define DMA2D_ISR_CTCIF_Pos                 (4U)
#define DMA2D_ISR_CTCIF_Msk                 (0x1UL << DMA2D_ISR_CTCIF_Pos)          /*!< 0x00000010 */
#define DMA2D_ISR_CTCIF                     DMA2D_ISR_CTCIF_Msk                     /*!< CLUT Transfer Complete Interrupt Flag */
#define DMA2D_ISR_CEIF_Pos                  (5U)
#define DMA2D_ISR_CEIF_Msk                  (0x1UL << DMA2D_ISR_CEIF_Pos)           /*!< 0x00000020 */
#define DMA2D_ISR_CEIF                      DMA2D_ISR_CEIF_Msk                      /*!< Configuration Error Interrupt Flag    */
#define DMA2D_ISR_RBCIF_Pos                 (8U)
#define DMA2D_ISR_RBCIF_Msk                 (0x1UL << DMA2D_ISR_RBCIF_Pos)          /*!< 0x00000100 */
#define DMA2D_ISR_RBCIF                     DMA2D_ISR_RBCIF_Msk                     /*!< Read Bus Error Interrupt Flag          */
#define DMA2D_ISR_RBEIF_Pos                 (9U)
#define DMA2D_ISR_RBEIF_Msk                 (0x1UL << DMA2D_ISR_RBEIF_Pos)          /*!< 0x00000200 */
#define DMA2D_ISR_RBEIF                     DMA2D_ISR_RBEIF_Msk                     /*!< Read Bus Error Interrupt Flag          */
#define DMA2D_ISR_CLSIF_Pos                 (12U)
#define DMA2D_ISR_CLSIF_Msk                 (0x1UL << DMA2D_ISR_CLSIF_Pos)          /*!< 0x00000400 */
#define DMA2D_ISR_CLSIF                     DMA2D_ISR_CLSIF_Msk                     /*!< CLUT Loading Suspend Interrupt Flag    */
#define DMA2D_ISR_CLEIF_Pos                 (13U)
#define DMA2D_ISR_CLEIF_Msk                 (0x1UL << DMA2D_ISR_CLEIF_Pos)          /*!< 0x00000800 */
#define DMA2D_ISR_CLEIF                     DMA2D_ISR_CLEIF_Msk                     /*!< CLUT Loading Error Interrupt Flag      */
#define DMA2D_ISR_GPF0IF_Pos                (16U)
#define DMA2D_ISR_GPF0IF_Msk                (0x1UL << DMA2D_ISR_GPF0IF_Pos)         /*!< 0x00010000 */
#define DMA2D_ISR_GPF0IF                    DMA2D_ISR_GPF0IF_Msk                    /*!< General Purpose Flag 0 Interrupt Flag  */
#define DMA2D_ISR_GPF1IF_Pos                (17U)
#define DMA2D_ISR_GPF1IF_Msk                (0x1UL << DMA2D_ISR_GPF1IF_Pos)         /*!< 0x00020000 */
#define DMA2D_ISR_GPF1IF                    DMA2D_ISR_GPF1IF_Msk                    /*!< General Purpose Flag 1 Interrupt Flag  */
#define DMA2D_ISR_GPF2IF_Pos                (18U)
#define DMA2D_ISR_GPF2IF_Msk                (0x1UL << DMA2D_ISR_GPF2IF_Pos)         /*!< 0x00040000 */
#define DMA2D_ISR_GPF2IF                    DMA2D_ISR_GPF2IF_Msk                    /*!< General Purpose Flag 2 Interrupt Flag  */
#define DMA2D_ISR_GPF3IF_Pos                (19U)
#define DMA2D_ISR_GPF3IF_Msk                (0x1UL << DMA2D_ISR_GPF3IF_Pos)         /*!< 0x00080000 */
#define DMA2D_ISR_GPF3IF                    DMA2D_ISR_GPF3IF_Msk                    /*!< General Purpose Flag 3 Interrupt Flag  */

/********************  Bit definition for DMA2D_IER register  ******************/
#define DMA2D_IER_TEIE_Pos                 (0U)
#define DMA2D_IER_TEIE_Msk                 (0x1UL << DMA2D_IER_TEIE_Pos)           /*!< 0x00000001 */
#define DMA2D_IER_TEIE                     DMA2D_IER_TEIE_Msk                      /*!< Transfer Error Interrupt Enable */
#define DMA2D_IER_TCIE_Pos                 (1U)
#define DMA2D_IER_TCIE_Msk                 (0x1UL << DMA2D_IER_TCIE_Pos)           /*!< 0x00000002 */
#define DMA2D_IER_TCIE                     DMA2D_IER_TCIE_Msk                      /*!< Transfer Complete Interrupt Enable */
#define DMA2D_IER_TWIE_Pos                 (2U)
#define DMA2D_IER_TWIE_Msk                 (0x1UL << DMA2D_IER_TWIE_Pos)           /*!< 0x00000004 */
#define DMA2D_IER_TWIE                     DMA2D_IER_TWIE_Msk                      /*!< Transfer Watermark Interrupt Enable */
#define DMA2D_IER_CAEIE_Pos                (3U)
#define DMA2D_IER_CAEIE_Msk                (0x1UL << DMA2D_IER_CAEIE_Pos)          /*!< 0x00000008 */
#define DMA2D_IER_CAEIE                    DMA2D_IER_CAEIE_Msk                     /*!< CLUT Access Error Interrupt Enable */
#define DMA2D_IER_CTCIE_Pos                (4U)
#define DMA2D_IER_CTCIE_Msk                (0x1UL << DMA2D_IER_CTCIE_Pos)          /*!< 0x00000010 */
#define DMA2D_IER_CTCIE                    DMA2D_IER_CTCIE_Msk                     /*!< CLUT Transfer Complete Interrupt Enable */
#define DMA2D_IER_CEIE_Pos                 (5U)
#define DMA2D_IER_CEIE_Msk                 (0x1UL << DMA2D_IER_CEIE_Pos)           /*!< 0x00000020 */
#define DMA2D_IER_CEIE                     DMA2D_IER_CEIE_Msk                      /*!< Configuration Error Interrupt Enable */
#define DMA2D_IER_RBCIE_Pos                (8U)
#define DMA2D_IER_RBCIE_Msk                (0x1UL << DMA2D_IER_RBCIE_Pos)          /*!< 0x00000100 */
#define DMA2D_IER_RBCIE                    DMA2D_IER_RBCIE_Msk                     /*!< Configuration Error Interrupt Enable */
#define DMA2D_IER_RBEIE_Pos                (9U)
#define DMA2D_IER_RBEIE_Msk                (0x1UL << DMA2D_IER_RBEIE_Pos)          /*!< 0x00000200 */
#define DMA2D_IER_RBEIE                    DMA2D_IER_RBEIE_Msk                     /*!< Configuration Error Interrupt Enable */
#define DMA2D_IER_CLSIE_Pos                (12U)
#define DMA2D_IER_CLSIE_Msk                (0x1UL << DMA2D_IER_CLSIE_Pos)          /*!< 0x00001000 */
#define DMA2D_IER_CLSIE                    DMA2D_IER_CLSIE_Msk                     /*!< Configuration Error Interrupt Enable */
#define DMA2D_IER_CLEIE_Pos                (13U)
#define DMA2D_IER_CLEIE_Msk                (0x1UL << DMA2D_IER_CLEIE_Pos)          /*!< 0x00002000 */
#define DMA2D_IER_CLEIE                    DMA2D_IER_CLEIE_Msk                     /*!< Configuration Error Interrupt Enable */
#define DMA2D_IER_GPF0IE_Pos               (16U)
#define DMA2D_IER_GPF0IE_Msk               (0x1UL << DMA2D_IER_GPF0IE_Pos)         /*!< 0x00000100 */
#define DMA2D_IER_GPF0IE                   DMA2D_IER_GPF0IE_Msk                    /*!< General Purpose Flag 0 Interrupt Enable */
#define DMA2D_IER_GPF1IE_Pos               (17U)
#define DMA2D_IER_GPF1IE_Msk               (0x1UL << DMA2D_IER_GPF1IE_Pos)         /*!< 0x00000200 */
#define DMA2D_IER_GPF1IE                   DMA2D_IER_GPF1IE_Msk                    /*!< General Purpose Flag 1 Interrupt Enable */
#define DMA2D_IER_GPF2IE_Pos               (18U)
#define DMA2D_IER_GPF2IE_Msk               (0x1UL << DMA2D_IER_GPF2IE_Pos)         /*!< 0x00000400 */
#define DMA2D_IER_GPF2IE                   DMA2D_IER_GPF2IE_Msk                    /*!< General Purpose Flag 2 Interrupt Enable */
#define DMA2D_IER_GPF3IE_Pos               (19U)
#define DMA2D_IER_GPF3IE_Msk               (0x1UL << DMA2D_IER_GPF3IE_Pos)         /*!< 0x00000800 */
#define DMA2D_IER_GPF3IE                   DMA2D_IER_GPF3IE_Msk                    /*!< General Purpose Flag 3 Interrupt Enable */

