zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f5xx.h
/******************  Bit definition for EXTI_RTSR3 register  *******************/
#define EXTI_RTSR3_RT64_Pos                 (0U)
#define EXTI_RTSR3_RT64_Msk                 (0x1UL << EXTI_RTSR3_RT64_Pos)          /*!< 0x00000001 */
#define EXTI_RTSR3_RT64                     EXTI_RTSR3_RT64_Msk                     /*!< Rising trigger event configuration bit of line 58 */
#define EXTI_RTSR3_RT66_Pos                 (2U)
#define EXTI_RTSR3_RT66_Msk                 (0x1UL << EXTI_RTSR3_RT66_Pos)          /*!< 0x00000004 */
#define EXTI_RTSR3_RT66                     EXTI_RTSR3_RT66_Msk                     /*!< Rising trigger event configuration bit of line 59 */

/******************  Bit definition for EXTI_FTSR3 register  *******************/
#define EXTI_FTSR3_FT64_Pos                 (0U)
#define EXTI_FTSR3_FT64_Msk                 (0x1UL << EXTI_FTSR3_FT64_Pos)          /*!< 0x00000001 */
#define EXTI_FTSR3_FT64                     EXTI_FTSR3_FT64_Msk                     /*!< Falling trigger event configuration bit of line 64 */
#define EXTI_FTSR3_FT66_Pos                 (2U)
#define EXTI_FTSR3_FT66_Msk                 (0x1UL << EXTI_FTSR3_FT66_Pos)          /*!< 0x00000004 */
#define EXTI_FTSR3_FT66                     EXTI_FTSR3_FT66_Msk                     /*!< Falling trigger event configuration bit of line 66 */

/******************  Bit definition for EXTI_SWIER3 register  ******************/
#define EXTI_SWIER3_SWIER64_Pos              (0U)
#define EXTI_SWIER3_SWIER64_Msk              (0x1UL << EXTI_SWIER3_SWIER64_Pos)     /*!< 0x00000001 */
#define EXTI_SWIER3_SWIER64                  EXTI_SWIER2_SWIER64_Msk                /*!< Software Interrupt on line 64 */
#define EXTI_SWIER3_SWIER66_Pos              (2U)
#define EXTI_SWIER3_SWIER66_Msk              (0x1UL << EXTI_SWIER3_SWIER66_Pos)     /*!< 0x00000004 */
#define EXTI_SWIER3_SWIER66                  EXTI_SWIER3_SWIER66_Msk                /*!< Software Interrupt on line 66 */

/******************  Bit definition for EXTI_RPR3 register  *******************/
#define EXTI_RPR3_RPIF_Pos                   (0U)
#define EXTI_RPR3_RPIF_Msk                   (0x5UL << EXTI_RPR3_RPIF_Pos)          /*!< 0x00000005 */
#define EXTI_RPR3_RPIF                       EXTI_RPR3_RPIF_Msk                     /*!< Rising pending edge configuration bits */
#define EXTI_RPR3_RPIF64_Pos                 (0U)
#define EXTI_RPR3_RPIF64_Msk                 (0x1UL << EXTI_RPR3_RPIF64_Pos)        /*!< 0x00000001 */
#define EXTI_RPR3_RPIF64                     EXTI_RPR3_RPIF64_Msk                   /*!< Rising pending edge configuration bit of line 64 */
#define EXTI_RPR3_RPIF66_Pos                 (2U)
#define EXTI_RPR3_RPIF66_Msk                 (0x1UL << EXTI_RPR3_RPIF66_Pos)        /*!< 0x00000004 */
#define EXTI_RPR3_RPIF66                     EXTI_RPR3_RPIF66_Msk                   /*!< Rising pending edge configuration bit of line 66 */

/******************  Bit definition for EXTI_FPR3 register  *******************/
#define EXTI_FPR3_FPIF_Pos                   (0U)
#define EXTI_FPR3_FPIF_Msk                   (0x5UL << EXTI_FPR3_FPIF_Pos)          /*!< 0x00000005 */
#define EXTI_FPR3_FPIF                       EXTI_FPR3_FPIF_Msk                     /*!< Rising falling edge configuration bits */
#define EXTI_FPR3_FPIF64_Pos                 (0U)
#define EXTI_FPR3_FPIF64_Msk                 (0x1UL << EXTI_FPR3_FPIF64_Pos)        /*!< 0x00000001 */
#define EXTI_FPR3_FPIF64                     EXTI_FPR3_FPIF64_Msk                   /*!< Rising falling edge configuration bit of line 64 */
#define EXTI_FPR3_FPIF66_Pos                 (2U)
#define EXTI_FPR3_FPIF66_Msk                 (0x1UL << EXTI_FPR3_FPIF66_Pos)        /*!< 0x00000004 */
#define EXTI_FPR3_FPIF66                     EXTI_FPR3_FPIF66_Msk                   /*!< Rising falling edge configuration bit of line 66 */

/*******************  Bit definition for EXTI_SECENR3 register  ******************/
#define EXTI_SECENR3_SEC64_Pos              (0U)
#define EXTI_SECENR3_SEC64_Msk              (0x1UL << EXTI_SECENR3_SEC64_Pos)       /*!< 0x00000001 */
#define EXTI_SECENR3_SEC64                  EXTI_SECENR3_SEC64_Msk                  /*!< Security enable on line 64 */
#define EXTI_SECENR3_SEC65_Pos              (1U)
#define EXTI_SECENR3_SEC65_Msk              (0x1UL << EXTI_SECENR3_SEC65_Pos)       /*!< 0x00000002 */
#define EXTI_SECENR3_SEC65                  EXTI_SECENR3_SEC65_Msk                  /*!< Security enable on line 65 */
#define EXTI_SECENR3_SEC66_Pos              (2U)
#define EXTI_SECENR3_SEC66_Msk              (0x1UL << EXTI_SECENR3_SEC66_Pos)       /*!< 0x00000004 */
#define EXTI_SECENR3_SEC66                  EXTI_SECENR3_SEC66_Msk                  /*!< Security enable on line 66 */

/*******************  Bit definition for EXTI_PRIVENR3 register  ******************/
#define EXTI_PRIVENR3_PRIV64_Pos              (0U)
#define EXTI_PRIVENR3_PRIV64_Msk              (0x1UL << EXTI_PRIVENR3_PRIV64_Pos)       /*!< 0x00000001 */
#define EXTI_PRIVENR3_PRIV64                  EXTI_PRIVENR3_PRIV64_Msk                  /*!< Security enable on line 64 */
#define EXTI_PRIVENR3_PRIV65_Pos              (1U)
#define EXTI_PRIVENR3_PRIV65_Msk              (0x1UL << EXTI_PRIVENR3_PRIV65_Pos)       /*!< 0x00000002 */
#define EXTI_PRIVENR3_PRIV65                  EXTI_PRIVENR3_PRIV65_Msk                  /*!< Security enable on line 65 */
#define EXTI_PRIVENR3_PRIV66_Pos              (2U)
#define EXTI_PRIVENR3_PRIV66_Msk              (0x1UL << EXTI_PRIVENR3_PRIV66_Pos)       /*!< 0x00000004 */
#define EXTI_PRIVENR3_PRIV66                  EXTI_PRIVENR3_PRIV66_Msk                  /*!< Security enable on line 66 */

/*****************  Bit definition for EXTI_EXTICR1 register  **************/
#define EXTI_EXTICR1_EXTI0_Pos              (0U)
#define EXTI_EXTICR1_EXTI0_Msk              (0xFUL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000007 */
#define EXTI_EXTICR1_EXTI0                  EXTI_EXTICR1_EXTI0_Msk                  /*!< EXTI 0 configuration */
#define EXTI_EXTICR1_EXTI0_0                (0x1UL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000001 */
#define EXTI_EXTICR1_EXTI0_1                (0x2UL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000002 */
#define EXTI_EXTICR1_EXTI0_2                (0x4UL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000004 */
#define EXTI_EXTICR1_EXTI0_3                (0x8UL << EXTI_EXTICR1_EXTI0_Pos)       /*!< 0x00000008 */
#define EXTI_EXTICR1_EXTI1_Pos              (8U)
#define EXTI_EXTICR1_EXTI1_Msk              (0xFUL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000700 */
#define EXTI_EXTICR1_EXTI1                  EXTI_EXTICR1_EXTI1_Msk                  /*!< EXTI 1 configuration */
#define EXTI_EXTICR1_EXTI1_0                (0x1UL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000100 */
#define EXTI_EXTICR1_EXTI1_1                (0x2UL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000200 */
#define EXTI_EXTICR1_EXTI1_2                (0x4UL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000400 */
#define EXTI_EXTICR1_EXTI1_3                (0x8UL << EXTI_EXTICR1_EXTI1_Pos)       /*!< 0x00000800 */
#define EXTI_EXTICR1_EXTI2_Pos              (16U)
#define EXTI_EXTICR1_EXTI2_Msk              (0xFUL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00070000 */
#define EXTI_EXTICR1_EXTI2                  EXTI_EXTICR1_EXTI2_Msk                  /*!< EXTI 2 configuration */
#define EXTI_EXTICR1_EXTI2_0                (0x1UL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00010000 */
#define EXTI_EXTICR1_EXTI2_1                (0x2UL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00020000 */
#define EXTI_EXTICR1_EXTI2_2                (0x4UL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00040000 */
#define EXTI_EXTICR1_EXTI2_3                (0x8UL << EXTI_EXTICR1_EXTI2_Pos)       /*!< 0x00080000 */
#define EXTI_EXTICR1_EXTI3_Pos              (24U)
#define EXTI_EXTICR1_EXTI3_Msk              (0xFUL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x07000000 */
#define EXTI_EXTICR1_EXTI3                  EXTI_EXTICR1_EXTI3_Msk                  /*!< EXTI 3 configuration */
#define EXTI_EXTICR1_EXTI3_0                (0x1UL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x01000000 */
#define EXTI_EXTICR1_EXTI3_1                (0x2UL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x02000000 */
#define EXTI_EXTICR1_EXTI3_2                (0x4UL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x04000000 */
#define EXTI_EXTICR1_EXTI3_3                (0x8UL << EXTI_EXTICR1_EXTI3_Pos)       /*!< 0x08000000 */

/*****************  Bit definition for EXTI_EXTICR2 register  **************/
#define EXTI_EXTICR2_EXTI4_Pos              (0U)
#define EXTI_EXTICR2_EXTI4_Msk              (0xFUL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000007 */
#define EXTI_EXTICR2_EXTI4                  EXTI_EXTICR2_EXTI4_Msk                  /*!< EXTI 4 configuration */
#define EXTI_EXTICR2_EXTI4_0                (0x1UL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000001 */
#define EXTI_EXTICR2_EXTI4_1                (0x2UL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000002 */
#define EXTI_EXTICR2_EXTI4_2                (0x4UL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000004 */
#define EXTI_EXTICR2_EXTI4_3                (0x8UL << EXTI_EXTICR2_EXTI4_Pos)       /*!< 0x00000008 */
#define EXTI_EXTICR2_EXTI5_Pos              (8U)
#define EXTI_EXTICR2_EXTI5_Msk              (0xFUL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000700 */
#define EXTI_EXTICR2_EXTI5                  EXTI_EXTICR2_EXTI5_Msk                  /*!< EXTI 5 configuration */
#define EXTI_EXTICR2_EXTI5_0                (0x1UL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000100 */
#define EXTI_EXTICR2_EXTI5_1                (0x2UL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000200 */
#define EXTI_EXTICR2_EXTI5_2                (0x4UL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000400 */
#define EXTI_EXTICR2_EXTI5_3                (0x8UL << EXTI_EXTICR2_EXTI5_Pos)       /*!< 0x00000800 */
#define EXTI_EXTICR2_EXTI6_Pos              (16U)
#define EXTI_EXTICR2_EXTI6_Msk              (0xFUL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00070000 */
#define EXTI_EXTICR2_EXTI6                  EXTI_EXTICR2_EXTI6_Msk                  /*!< EXTI 6 configuration */
#define EXTI_EXTICR2_EXTI6_0                (0x1UL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00010000 */
#define EXTI_EXTICR2_EXTI6_1                (0x2UL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00020000 */
#define EXTI_EXTICR2_EXTI6_2                (0x4UL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00040000 */
#define EXTI_EXTICR2_EXTI6_3                (0x8UL << EXTI_EXTICR2_EXTI6_Pos)       /*!< 0x00080000 */
#define EXTI_EXTICR2_EXTI7_Pos              (24U)
#define EXTI_EXTICR2_EXTI7_Msk              (0xFUL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x07000000 */
#define EXTI_EXTICR2_EXTI7                  EXTI_EXTICR2_EXTI7_Msk                  /*!< EXTI 7 configuration */
#define EXTI_EXTICR2_EXTI7_0                (0x1UL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x01000000 */
#define EXTI_EXTICR2_EXTI7_1                (0x2UL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x02000000 */
#define EXTI_EXTICR2_EXTI7_2                (0x4UL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x04000000 */
#define EXTI_EXTICR2_EXTI7_3                (0x8UL << EXTI_EXTICR2_EXTI7_Pos)       /*!< 0x08000000 */

