zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f5xx.h
#define PLAY_SWINSET_SWIN15_Pos         (15U)
#define PLAY_SWINSET_SWIN15_Msk         (0x01UL << PLAY_SWINSET_SWIN15_Pos)     /*!< 0x00008000 */
#define PLAY_SWINSET_SWIN15             PLAY_SWINSET_SWIN15_Msk                 /*!< Set SWIN15 input */

/******************  Bit definition for PLAY_SWINCLR register  ****************/
#define PLAY_SWINCLR_SWIN0_Pos          (0U)
#define PLAY_SWINCLR_SWIN0_Msk          (0x01UL << PLAY_SWINCLR_SWIN0_Pos)      /*!< 0x00000001 */
#define PLAY_SWINCLR_SWIN0              PLAY_SWINCLR_SWIN0_Msk                  /*!< Reset SWIN0 input */

#define PLAY_SWINCLR_SWIN1_Pos          (1U)
#define PLAY_SWINCLR_SWIN1_Msk          (0x01UL << PLAY_SWINCLR_SWIN1_Pos)      /*!< 0x00000002 */
#define PLAY_SWINCLR_SWIN1              PLAY_SWINCLR_SWIN1_Msk                  /*!< Reset SWIN1 input */

#define PLAY_SWINCLR_SWIN2_Pos          (2U)
#define PLAY_SWINCLR_SWIN2_Msk          (0x01UL << PLAY_SWINCLR_SWIN2_Pos)      /*!< 0x00000004 */
#define PLAY_SWINCLR_SWIN2              PLAY_SWINCLR_SWIN2_Msk                  /*!< Reset SWIN2 input */

#define PLAY_SWINCLR_SWIN3_Pos          (3U)
#define PLAY_SWINCLR_SWIN3_Msk          (0x01UL << PLAY_SWINCLR_SWIN3_Pos)      /*!< 0x00000008 */
#define PLAY_SWINCLR_SWIN3              PLAY_SWINCLR_SWIN3_Msk                  /*!< Reset SWIN3 input */

#define PLAY_SWINCLR_SWIN4_Pos          (4U)
#define PLAY_SWINCLR_SWIN4_Msk          (0x01UL << PLAY_SWINCLR_SWIN4_Pos)      /*!< 0x00000010 */
#define PLAY_SWINCLR_SWIN4              PLAY_SWINCLR_SWIN4_Msk                  /*!< Reset SWIN4 input */

#define PLAY_SWINCLR_SWIN5_Pos          (5U)
#define PLAY_SWINCLR_SWIN5_Msk          (0x01UL << PLAY_SWINCLR_SWIN5_Pos)      /*!< 0x00000020 */
#define PLAY_SWINCLR_SWIN5              PLAY_SWINCLR_SWIN5_Msk                  /*!< Reset SWIN5 input */

#define PLAY_SWINCLR_SWIN6_Pos          (6U)
#define PLAY_SWINCLR_SWIN6_Msk          (0x01UL << PLAY_SWINCLR_SWIN6_Pos)      /*!< 0x00000040 */
#define PLAY_SWINCLR_SWIN6              PLAY_SWINCLR_SWIN6_Msk                  /*!< Reset SWIN6 input */

#define PLAY_SWINCLR_SWIN7_Pos          (7U)
#define PLAY_SWINCLR_SWIN7_Msk          (0x01UL << PLAY_SWINCLR_SWIN7_Pos)      /*!< 0x00000080 */
#define PLAY_SWINCLR_SWIN7              PLAY_SWINCLR_SWIN7_Msk                  /*!< Reset SWIN7 input */

#define PLAY_SWINCLR_SWIN8_Pos          (8U)
#define PLAY_SWINCLR_SWIN8_Msk          (0x01UL << PLAY_SWINCLR_SWIN8_Pos)      /*!< 0x00000100 */
#define PLAY_SWINCLR_SWIN8              PLAY_SWINCLR_SWIN8_Msk                  /*!< Reset SWIN8 input */

#define PLAY_SWINCLR_SWIN9_Pos          (9U)
#define PLAY_SWINCLR_SWIN9_Msk          (0x01UL << PLAY_SWINCLR_SWIN9_Pos)      /*!< 0x00000200 */
#define PLAY_SWINCLR_SWIN9              PLAY_SWINCLR_SWIN9_Msk                  /*!< Reset SWIN9 input */

#define PLAY_SWINCLR_SWIN10_Pos         (10U)
#define PLAY_SWINCLR_SWIN10_Msk         (0x01UL << PLAY_SWINCLR_SWIN10_Pos)     /*!< 0x00000400 */
#define PLAY_SWINCLR_SWIN10             PLAY_SWINCLR_SWIN10_Msk                 /*!< Reset SWIN10 input */

#define PLAY_SWINCLR_SWIN11_Pos         (11U)
#define PLAY_SWINCLR_SWIN11_Msk         (0x01UL << PLAY_SWINCLR_SWIN11_Pos)     /*!< 0x00000800 */
#define PLAY_SWINCLR_SWIN11             PLAY_SWINCLR_SWIN11_Msk                 /*!< Reset SWIN11 input */

#define PLAY_SWINCLR_SWIN12_Pos         (12U)
#define PLAY_SWINCLR_SWIN12_Msk         (0x01UL << PLAY_SWINCLR_SWIN12_Pos)     /*!< 0x00001000 */
#define PLAY_SWINCLR_SWIN12             PLAY_SWINCLR_SWIN12_Msk                 /*!< Reset SWIN12 input */

#define PLAY_SWINCLR_SWIN13_Pos         (13U)
#define PLAY_SWINCLR_SWIN13_Msk         (0x01UL << PLAY_SWINCLR_SWIN13_Pos)     /*!< 0x00002000 */
#define PLAY_SWINCLR_SWIN13             PLAY_SWINCLR_SWIN13_Msk                 /*!< Reset SWIN13 input */

#define PLAY_SWINCLR_SWIN14_Pos         (14U)
#define PLAY_SWINCLR_SWIN14_Msk         (0x01UL << PLAY_SWINCLR_SWIN14_Pos)     /*!< 0x00004000 */
#define PLAY_SWINCLR_SWIN14             PLAY_SWINCLR_SWIN14_Msk                 /*!< Reset SWIN14 input */

#define PLAY_SWINCLR_SWIN15_Pos         (15U)
#define PLAY_SWINCLR_SWIN15_Msk         (0x01UL << PLAY_SWINCLR_SWIN15_Pos)     /*!< 0x00008000 */
#define PLAY_SWINCLR_SWIN15             PLAY_SWINCLR_SWIN15_Msk                 /*!< Reset SWIN15 input */

/******************  Bit definition for PLAY_OSR register  ********************/
#define PLAY_OSR_LEOUTD0_Pos          (0U)
#define PLAY_OSR_LEOUTD0_Msk          (0x01UL << PLAY_OSR_LEOUTD0_Pos)          /*!< 0x00000001 */
#define PLAY_OSR_LEOUTD0              PLAY_OSR_LEOUTD0_Msk                      /*!< LEOUTD0 output */

#define PLAY_OSR_LEOUTD1_Pos          (1U)
#define PLAY_OSR_LEOUTD1_Msk          (0x01UL << PLAY_OSR_LEOUTD1_Pos)          /*!< 0x00000002 */
#define PLAY_OSR_LEOUTD1              PLAY_OSR_LEOUTD1_Msk                      /*!< LEOUTD1 output */

#define PLAY_OSR_LEOUTD2_Pos          (2U)
#define PLAY_OSR_LEOUTD2_Msk          (0x01UL << PLAY_OSR_LEOUTD2_Pos)          /*!< 0x00000004 */
#define PLAY_OSR_LEOUTD2              PLAY_OSR_LEOUTD2_Msk                      /*!< LEOUTD2 output */

#define PLAY_OSR_LEOUTD3_Pos          (3U)
#define PLAY_OSR_LEOUTD3_Msk          (0x01UL << PLAY_OSR_LEOUTD3_Pos)          /*!< 0x00000008 */
#define PLAY_OSR_LEOUTD3              PLAY_OSR_LEOUTD3_Msk                      /*!< LEOUTD3 output */

#define PLAY_OSR_LEOUTD4_Pos          (4U)
#define PLAY_OSR_LEOUTD4_Msk          (0x01UL << PLAY_OSR_LEOUTD4_Pos)          /*!< 0x00000010 */
#define PLAY_OSR_LEOUTD4              PLAY_OSR_LEOUTD4_Msk                      /*!< LEOUTD4 output */

#define PLAY_OSR_LEOUTD5_Pos          (5U)
#define PLAY_OSR_LEOUTD5_Msk          (0x01UL << PLAY_OSR_LEOUTD5_Pos)          /*!< 0x00000020 */
#define PLAY_OSR_LEOUTD5              PLAY_OSR_LEOUTD5_Msk                      /*!< LEOUTD5 output */

#define PLAY_OSR_LEOUTD6_Pos          (6U)
#define PLAY_OSR_LEOUTD6_Msk          (0x01UL << PLAY_OSR_LEOUTD6_Pos)          /*!< 0x00000040 */
#define PLAY_OSR_LEOUTD6              PLAY_OSR_LEOUTD6_Msk                      /*!< LEOUTD6 output */

#define PLAY_OSR_LEOUTD7_Pos          (7U)
#define PLAY_OSR_LEOUTD7_Msk          (0x01UL << PLAY_OSR_LEOUTD7_Pos)          /*!< 0x00000080 */
#define PLAY_OSR_LEOUTD7              PLAY_OSR_LEOUTD7_Msk                      /*!< LEOUTD7 output */

#define PLAY_OSR_LEOUTD8_Pos          (8U)
#define PLAY_OSR_LEOUTD8_Msk          (0x01UL << PLAY_OSR_LEOUTD8_Pos)          /*!< 0x00000100 */
#define PLAY_OSR_LEOUTD8              PLAY_OSR_LEOUTD8_Msk                      /*!< LEOUTD8 output */

#define PLAY_OSR_LEOUTD9_Pos          (9U)
#define PLAY_OSR_LEOUTD9_Msk          (0x01UL << PLAY_OSR_LEOUTD9_Pos)          /*!< 0x00000200 */
#define PLAY_OSR_LEOUTD9              PLAY_OSR_LEOUTD9_Msk                      /*!< LEOUTD9 output */

#define PLAY_OSR_LEOUTD10_Pos         (10U)
#define PLAY_OSR_LEOUTD10_Msk         (0x01UL << PLAY_OSR_LEOUTD10_Pos)         /*!< 0x00000400 */
#define PLAY_OSR_LEOUTD10             PLAY_OSR_LEOUTD10_Msk                     /*!< LEOUTD10 output */

