zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f5xx.h
#define PLAY_FLCTL_FLAGD_EDGE12_Pos    (12U)
#define PLAY_FLCTL_FLAGD_EDGE12_Msk    (0x01UL << PLAY_FLCTL_FLAGD_EDGE12_Pos)  /*!< 0x00001000 */
#define PLAY_FLCTL_FLAGD_EDGE12        PLAY_FLCTL_FLAGD_EDGE12_Msk              /*!< Edge Direction for Output Direct12 */

#define PLAY_FLCTL_FLAGD_EDGE13_Pos    (13U)
#define PLAY_FLCTL_FLAGD_EDGE13_Msk    (0x01UL << PLAY_FLCTL_FLAGD_EDGE13_Pos)  /*!< 0x00002000 */
#define PLAY_FLCTL_FLAGD_EDGE13        PLAY_FLCTL_FLAGD_EDGE13_Msk              /*!< Edge Direction for Output Direct13 */

#define PLAY_FLCTL_FLAGD_EDGE14_Pos    (14U)
#define PLAY_FLCTL_FLAGD_EDGE14_Msk    (0x01UL << PLAY_FLCTL_FLAGD_EDGE14_Pos)  /*!< 0x00004000 */
#define PLAY_FLCTL_FLAGD_EDGE14        PLAY_FLCTL_FLAGD_EDGE14_Msk              /*!< Edge Direction for Output Direct14 */

#define PLAY_FLCTL_FLAGD_EDGE15_Pos    (15U)
#define PLAY_FLCTL_FLAGD_EDGE15_Msk    (0x01UL << PLAY_FLCTL_FLAGD_EDGE15_Pos)  /*!< 0x00008000 */
#define PLAY_FLCTL_FLAGD_EDGE15        PLAY_FLCTL_FLAGD_EDGE15_Msk              /*!< Edge Direction for Output Direct15 */

#define PLAY_FLCTL_FLAGR_EDGE0_Pos     (16U)
#define PLAY_FLCTL_FLAGR_EDGE0_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE0_Pos)   /*!< 0x00010000 */
#define PLAY_FLCTL_FLAGR_EDGE0         PLAY_FLCTL_FLAGR_EDGE0_Msk               /*!< Edge Direction for Output Register 0 */

#define PLAY_FLCTL_FLAGR_EDGE1_Pos     (17U)
#define PLAY_FLCTL_FLAGR_EDGE1_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE1_Pos)   /*!< 0x00020000 */
#define PLAY_FLCTL_FLAGR_EDGE1         PLAY_FLCTL_FLAGR_EDGE1_Msk               /*!< Edge Direction for Output Register 1 */

#define PLAY_FLCTL_FLAGR_EDGE2_Pos     (18U)
#define PLAY_FLCTL_FLAGR_EDGE2_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE2_Pos)   /*!< 0x00040000 */
#define PLAY_FLCTL_FLAGR_EDGE2         PLAY_FLCTL_FLAGR_EDGE2_Msk               /*!< Edge Direction for Output Register 2 */

#define PLAY_FLCTL_FLAGR_EDGE3_Pos     (19U)
#define PLAY_FLCTL_FLAGR_EDGE3_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE3_Pos)   /*!< 0x00080000 */
#define PLAY_FLCTL_FLAGR_EDGE3         PLAY_FLCTL_FLAGR_EDGE3_Msk               /*!< Edge Direction for Output Register 3 */

#define PLAY_FLCTL_FLAGR_EDGE4_Pos     (20U)
#define PLAY_FLCTL_FLAGR_EDGE4_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE4_Pos)   /*!< 0x00100000 */
#define PLAY_FLCTL_FLAGR_EDGE4         PLAY_FLCTL_FLAGR_EDGE4_Msk               /*!< Edge Direction for Output Register 4 */

#define PLAY_FLCTL_FLAGR_EDGE5_Pos     (21U)
#define PLAY_FLCTL_FLAGR_EDGE5_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE5_Pos)   /*!< 0x00200000 */
#define PLAY_FLCTL_FLAGR_EDGE5         PLAY_FLCTL_FLAGR_EDGE5_Msk               /*!< Edge Direction for Output Register 5 */

#define PLAY_FLCTL_FLAGR_EDGE6_Pos     (22U)
#define PLAY_FLCTL_FLAGR_EDGE6_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE6_Pos)   /*!< 0x00400000 */
#define PLAY_FLCTL_FLAGR_EDGE6         PLAY_FLCTL_FLAGR_EDGE6_Msk               /*!< Edge Direction for Output Register 6 */

#define PLAY_FLCTL_FLAGR_EDGE7_Pos     (23U)
#define PLAY_FLCTL_FLAGR_EDGE7_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE7_Pos)   /*!< 0x00800000 */
#define PLAY_FLCTL_FLAGR_EDGE7         PLAY_FLCTL_FLAGR_EDGE7_Msk               /*!< Edge Direction for Output Register 7 */

#define PLAY_FLCTL_FLAGR_EDGE8_Pos     (24U)
#define PLAY_FLCTL_FLAGR_EDGE8_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE8_Pos)   /*!< 0x01000000 */
#define PLAY_FLCTL_FLAGR_EDGE8         PLAY_FLCTL_FLAGR_EDGE8_Msk               /*!< Edge Direction for Output Register 8 */

#define PLAY_FLCTL_FLAGR_EDGE9_Pos     (25U)
#define PLAY_FLCTL_FLAGR_EDGE9_Msk     (0x01UL << PLAY_FLCTL_FLAGR_EDGE9_Pos)   /*!< 0x02000000 */
#define PLAY_FLCTL_FLAGR_EDGE9         PLAY_FLCTL_FLAGR_EDGE9_Msk               /*!< Edge Direction for Output Register 9 */

#define PLAY_FLCTL_FLAGR_EDGE10_Pos    (26U)
#define PLAY_FLCTL_FLAGR_EDGE10_Msk    (0x01UL << PLAY_FLCTL_FLAGR_EDGE10_Pos)  /*!< 0x04000000 */
#define PLAY_FLCTL_FLAGR_EDGE10        PLAY_FLCTL_FLAGR_EDGE10_Msk              /*!< Edge Direction for Output Register 10 */

#define PLAY_FLCTL_FLAGR_EDGE11_Pos    (27U)
#define PLAY_FLCTL_FLAGR_EDGE11_Msk    (0x01UL << PLAY_FLCTL_FLAGR_EDGE11_Pos)  /*!< 0x08000000 */
#define PLAY_FLCTL_FLAGR_EDGE11        PLAY_FLCTL_FLAGR_EDGE11_Msk              /*!< Edge Direction for Output Register 11 */

#define PLAY_FLCTL_FLAGR_EDGE12_Pos    (28U)
#define PLAY_FLCTL_FLAGR_EDGE12_Msk    (0x01UL << PLAY_FLCTL_FLAGR_EDGE12_Pos)  /*!< 0x10000000 */
#define PLAY_FLCTL_FLAGR_EDGE12        PLAY_FLCTL_FLAGR_EDGE12_Msk              /*!< Edge Direction for Output Register 12 */

#define PLAY_FLCTL_FLAGR_EDGE13_Pos    (29U)
#define PLAY_FLCTL_FLAGR_EDGE13_Msk    (0x01UL << PLAY_FLCTL_FLAGR_EDGE13_Pos)  /*!< 0x20000000 */
#define PLAY_FLCTL_FLAGR_EDGE13        PLAY_FLCTL_FLAGR_EDGE13_Msk              /*!< Edge Direction for Output Register 13 */

#define PLAY_FLCTL_FLAGR_EDGE14_Pos    (30U)
#define PLAY_FLCTL_FLAGR_EDGE14_Msk    (0x01UL << PLAY_FLCTL_FLAGR_EDGE14_Pos)  /*!< 0x40000000 */
#define PLAY_FLCTL_FLAGR_EDGE14        PLAY_FLCTL_FLAGR_EDGE14_Msk              /*!< Edge Direction for Output Register 14 */

#define PLAY_FLCTL_FLAGR_EDGE15_Pos    (31U)
#define PLAY_FLCTL_FLAGR_EDGE15_Msk    (0x01UL << PLAY_FLCTL_FLAGR_EDGE15_Pos)  /*!< 0x80000000 */
#define PLAY_FLCTL_FLAGR_EDGE15        PLAY_FLCTL_FLAGR_EDGE15_Msk              /*!< Edge Direction for Output Register 15 */

/******************  Bit definition for PLAY_MSR register  ********************/
#define PLAY_MSR_SWINWBFS_Pos           (0U)
#define PLAY_MSR_SWINWBFS_Msk           (0x01UL << PLAY_MSR_SWINWBFS_Pos)       /*!< 0x00000001 */
#define PLAY_MSR_SWINWBFS               PLAY_MSR_SWINWBFS_Msk                   /*!< SWIN Register Write Busy Flag Status */

#define PLAY_MSR_FLCTLWBFS_Pos          (1U)
#define PLAY_MSR_FLCTLWBFS_Msk          (0x01UL << PLAY_MSR_FLCTLWBFS_Pos)      /*!< 0x00000002 */
#define PLAY_MSR_FLCTLWBFS              PLAY_MSR_FLCTLWBFS_Msk                  /*!< FLCTL Register Write Busy Flag Status */

/******************  Bit definition for PLAY_ISR register  ********************/
#define PLAY_ISR_SWINWC_Pos             (0U)
#define PLAY_ISR_SWINWC_Msk             (0x01UL << PLAY_ISR_SWINWC_Pos)         /*!< 0x00000001 */
#define PLAY_ISR_SWINWC                 PLAY_ISR_SWINWC_Msk                     /*!< SWIN Register Write Complete Interrupt Status */

#define PLAY_ISR_FLCTLWC_Pos            (1U)
#define PLAY_ISR_FLCTLWC_Msk            (0x01UL << PLAY_ISR_FLCTLWC_Pos)        /*!< 0x00000002 */
#define PLAY_ISR_FLCTLWC                PLAY_ISR_FLCTLWC_Msk                    /*!< FLCTL Register Write Complete Interrupt Status */

#define PLAY_ISR_FLAGS_Pos              (2U)
#define PLAY_ISR_FLAGS_Msk              (0x01UL << PLAY_ISR_FLAGS_Pos)          /*!< 0x00000004 */
#define PLAY_ISR_FLAGS                  PLAY_ISR_FLAGS_Msk                      /*!< Flags Interrupt Status */

/******************  Bit definition for PLAY_ICR register  ********************/
#define PLAY_ICR_SWINWC_CLR_Pos         (0U)
#define PLAY_ICR_SWINWC_CLR_Msk         (0x01UL << PLAY_ICR_SWINWC_CLR_Pos)      /*!< 0x00000001 */
#define PLAY_ICR_SWINWC_CLR             PLAY_ICR_SWINWC_CLR_Msk                 /*!< SWIN Register Write Complete Clear Interrupt */

#define PLAY_ICR_FLCTLWC_CLR_Pos        (1U)
#define PLAY_ICR_FLCTLWC_CLR_Msk        (0x01UL << PLAY_ICR_FLCTLWC_CLR_Pos)     /*!< 0x00000002 */
#define PLAY_ICR_FLCTLWC_CLR            PLAY_ICR_FLCTLWC_CLR_Msk                /*!< FLCTL Register Write Complete Clear Interrupt */

/******************  Bit definition for PLAY_IER register  ********************/
#define PLAY_IER_SWINWC_IEN_Pos         (0U)
#define PLAY_IER_SWINWC_IEN_Msk         (0x01UL << PLAY_IER_SWINWC_IEN_Pos)     /*!< 0x00000001 */
#define PLAY_IER_SWINWC_IEN             PLAY_IER_SWINWC_IEN_Msk                 /*!< SWIN Register Write Complete Interrupt Enable */

#define PLAY_IER_FLCTLWC_IEN_Pos        (1U)
#define PLAY_IER_FLCTLWC_IEN_Msk        (0x01UL << PLAY_IER_FLCTLWC_IEN_Pos)    /*!< 0x00000002 */
#define PLAY_IER_FLCTLWC_IEN            PLAY_IER_FLCTLWC_IEN_Msk                /*!< FLCTL Register Write Complete Interrupt Enable */

/******************************************************************************/
/*                                                                            */
/*                Parallel Synchronous Slave Interface (PSSI )                */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for PSSI_CR register  *******************/
#define PSSI_CR_CKPOL_Pos                   (5U)
#define PSSI_CR_CKPOL_Msk                   (0x1UL << PSSI_CR_CKPOL_Pos)            /*!< 0x00000020 */
#define PSSI_CR_CKPOL                       PSSI_CR_CKPOL_Msk                       /*!< Parallel data clock polarity */
#define PSSI_CR_DEPOL_Pos                   (6U)
#define PSSI_CR_DEPOL_Msk                   (0x1UL << PSSI_CR_DEPOL_Pos)            /*!< 0x00000040 */
#define PSSI_CR_DEPOL                       PSSI_CR_DEPOL_Msk                       /*!<  Data enable polarity */
#define PSSI_CR_RDYPOL_Pos                  (8U)
#define PSSI_CR_RDYPOL_Msk                  (0x1UL << PSSI_CR_RDYPOL_Pos)           /*!< 0x00000100 */
#define PSSI_CR_RDYPOL                      PSSI_CR_RDYPOL_Msk                      /*!< Ready polarity */
#define PSSI_CR_EDM_Pos                     (10U)
#define PSSI_CR_EDM_Msk                     (0x3UL << PSSI_CR_EDM_Pos)              /*!< 0x00000C00 */
#define PSSI_CR_EDM                         PSSI_CR_EDM_Msk                         /*!< Extended data mode */
#define PSSI_CR_ENABLE_Pos                  (14U)
#define PSSI_CR_ENABLE_Msk                  (0x1UL << PSSI_CR_ENABLE_Pos)           /*!< 0x00004000 */
#define PSSI_CR_ENABLE                      PSSI_CR_ENABLE_Msk                      /*!< PSSI enable */
#define PSSI_CR_DERDYCFG_Pos                (18U)
#define PSSI_CR_DERDYCFG_Msk                (0x7UL << PSSI_CR_DERDYCFG_Pos)         /*!< 0x001C0000 */
#define PSSI_CR_DERDYCFG                    PSSI_CR_DERDYCFG_Msk                    /*!< Data enable and ready configuration */
#define PSSI_CR_DMAEN_Pos                   (30U)
#define PSSI_CR_DMAEN_Msk                   (0x1UL << PSSI_CR_DMAEN_Pos)            /*!< 0x40000000 */
#define PSSI_CR_DMAEN                       PSSI_CR_DMAEN_Msk                       /*!< DMA enable */
#define PSSI_CR_OUTEN_Pos                   (31U)
#define PSSI_CR_OUTEN_Msk                   (0x1UL << PSSI_CR_OUTEN_Pos)            /*!< 0x80000000 */
#define PSSI_CR_OUTEN                       PSSI_CR_OUTEN_Msk                       /*!< Data direction selection */

/********************  Bit definition for PSSI_SR register  *******************/
#define PSSI_SR_RTT4B_Pos                   (2U)
#define PSSI_SR_RTT4B_Msk                   (0x1UL << PSSI_SR_RTT4B_Pos)            /*!< 0x00000004 */
#define PSSI_SR_RTT4B                       PSSI_SR_RTT4B_Msk                       /*!< Ready to transfer four bytes */
#define PSSI_SR_RTT1B_Pos                   (3U)
#define PSSI_SR_RTT1B_Msk                   (0x1UL << PSSI_SR_RTT1B_Pos)            /*!< 0x00000008 */
#define PSSI_SR_RTT1B                       PSSI_SR_RTT1B_Msk                       /*!< Ready to transfer one byte */

/********************  Bit definition for PSSI_RIS register  *******************/
#define PSSI_RIS_OVR_RIS_Pos                (1U)
#define PSSI_RIS_OVR_RIS_Msk                (0x1UL << PSSI_RIS_OVR_RIS_Pos)         /*!< 0x00000002 */
#define PSSI_RIS_OVR_RIS                    PSSI_RIS_OVR_RIS_Msk                    /*!< Data buffer overrun/underrun raw interrupt status */

/********************  Bit definition for PSSI_IER register  *******************/
#define PSSI_IER_OVR_IE_Pos                 (1U)
#define PSSI_IER_OVR_IE_Msk                 (0x1UL << PSSI_IER_OVR_IE_Pos)          /*!< 0x00000002 */
#define PSSI_IER_OVR_IE                     PSSI_IER_OVR_IE_Msk                     /*!< Data buffer overrun/underrun interrupt enable */

/********************  Bit definition for PSSI_MIS register  *******************/
#define PSSI_MIS_OVR_MIS_Pos                (1U)
#define PSSI_MIS_OVR_MIS_Msk                (0x1UL << PSSI_MIS_OVR_MIS_Pos)         /*!< 0x00000002 */
#define PSSI_MIS_OVR_MIS                    PSSI_MIS_OVR_MIS_Msk                    /*!< Data buffer overrun/underrun masked interrupt status */

