zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f5xx.h
/******************* TIM Instances : Timer input selection ********************/
#define IS_TIM_TISEL_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S) || \
                                         ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S) || \
                                         ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S) || \
                                         ((INSTANCE) == TIM4_NS)  || ((INSTANCE) == TIM4_S) || \
                                         ((INSTANCE) == TIM5_NS)  || ((INSTANCE) == TIM5_S) || \
                                         ((INSTANCE) == TIM8_NS)  || ((INSTANCE) == TIM8_S) || \
                                         ((INSTANCE) == TIM12_NS) || ((INSTANCE) == TIM12_S)|| \
                                         ((INSTANCE) == TIM13_NS) || ((INSTANCE) == TIM13_S)|| \
                                         ((INSTANCE) == TIM14_NS) || ((INSTANCE) == TIM14_S)|| \
                                         ((INSTANCE) == TIM15_NS) || ((INSTANCE) == TIM15_S)|| \
                                         ((INSTANCE) == TIM16_NS) || ((INSTANCE) == TIM16_S)|| \
                                         ((INSTANCE) == TIM17_NS) || ((INSTANCE) == TIM17_S))

/******************* TIM Instances : supporting bitfield RTCPREEN in OR1 register  ********************/
#define IS_TIM_RTCPREEN_INSTANCE(INSTANCE) (((INSTANCE) == TIM17_NS)  || ((INSTANCE) == TIM17_S))

/****************** TIM Instances : Advanced timer instances *******************/
#define IS_TIM_ADVANCED_INSTANCE(INSTANCE)       (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S) || \
                                                  ((INSTANCE) == TIM8_NS)  || ((INSTANCE) == TIM8_S))

/****************** TIM Instances : supporting synchronization ****************/
#define IS_TIM_SYNCHRO_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_NS)  || ((INSTANCE) == TIM1_S) || \
                                            ((INSTANCE) == TIM2_NS)  || ((INSTANCE) == TIM2_S) || \
                                            ((INSTANCE) == TIM3_NS)  || ((INSTANCE) == TIM3_S) || \
                                            ((INSTANCE) == TIM4_NS)  || ((INSTANCE) == TIM4_S) || \
                                            ((INSTANCE) == TIM5_NS)  || ((INSTANCE) == TIM5_S) || \
                                            ((INSTANCE) == TIM6_NS)  || ((INSTANCE) == TIM6_S) || \
                                            ((INSTANCE) == TIM7_NS)  || ((INSTANCE) == TIM7_S) || \
                                            ((INSTANCE) == TIM8_NS)  || ((INSTANCE) == TIM8_S) || \
                                            ((INSTANCE) == TIM12_NS) || ((INSTANCE) == TIM12_S)|| \
                                            ((INSTANCE) == TIM15_NS) || ((INSTANCE) == TIM15_S))

/******************** USART Instances : Synchronous mode **********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                     ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                     ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                     ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                     ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                     ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S))

/******************** UART Instances : Asynchronous mode **********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                    ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                    ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                    ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                    ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                    ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                    ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                    ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                    ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                    ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                    ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                    ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S))

/*********************** UART Instances : FIFO mode ***************************/
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                         ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                         ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                         ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                         ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                         ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                         ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                         ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                         ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                         ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                         ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                         ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S)  || \
                                         ((INSTANCE) == LPUART1_NS) || ((INSTANCE) == LPUART1_S))

