zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f5xx.h
/*********************** UART Instances : SPI Slave mode **********************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)   || \
                                              ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)   || \
                                              ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)   || \
                                              ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)   || \
                                              ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S)  || \
                                              ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S))

/******************************** I2S Instances *******************************/
#define IS_I2S_ALL_INSTANCE(INSTANCE)   (((INSTANCE) == SPI1) || \
                                         ((INSTANCE) == SPI2) || \
                                         ((INSTANCE) == SPI3))

/****************** UART Instances : Auto Baud Rate detection ****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                                            ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                                            ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                                            ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                                            ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                                            ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                                            ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                                            ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                                            ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                                            ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                                            ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                                            ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S))

/****************** UART Instances : Driver Enable *****************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE)     (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                                      ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                                      ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                                      ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                                      ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                                      ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                                      ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                                      ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                                      ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                                      ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                                      ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                                      ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S)  || \
                                                      ((INSTANCE) == LPUART1_NS) || ((INSTANCE) == LPUART1_S))

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)   (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                                 ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                                 ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                                 ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                                 ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                                 ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                                 ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                                 ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                                 ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                                 ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                                 ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                                 ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S)  || \
                                                 ((INSTANCE) == LPUART1_NS) || ((INSTANCE) == LPUART1_S))

/****************** UART Instances : Hardware Flow control ********************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                           ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                           ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                           ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                           ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                           ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                           ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                           ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                           ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                           ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                           ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                           ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S)  || \
                                           ((INSTANCE) == LPUART1_NS) || ((INSTANCE) == LPUART1_S))

/******************** UART Instances : LIN mode **********************/
#define IS_UART_LIN_INSTANCE(INSTANCE)   (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                          ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                          ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                          ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                          ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                          ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                          ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                          ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                          ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                          ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                          ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                          ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S))

/******************** UART Instances : Wake-up from Stop mode **********************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1_NS)  || ((INSTANCE) == USART1_S)  || \
                                                      ((INSTANCE) == USART2_NS)  || ((INSTANCE) == USART2_S)  || \
                                                      ((INSTANCE) == USART3_NS)  || ((INSTANCE) == USART3_S)  || \
                                                      ((INSTANCE) == UART4_NS)   || ((INSTANCE) == UART4_S)   || \
                                                      ((INSTANCE) == UART5_NS)   || ((INSTANCE) == UART5_S)   || \
                                                      ((INSTANCE) == USART6_NS)  || ((INSTANCE) == USART6_S)  || \
                                                      ((INSTANCE) == UART7_NS)   || ((INSTANCE) == UART7_S)   || \
                                                      ((INSTANCE) == UART8_NS)   || ((INSTANCE) == UART8_S)   || \
                                                      ((INSTANCE) == UART9_NS)   || ((INSTANCE) == UART9_S)   || \
                                                      ((INSTANCE) == USART10_NS) || ((INSTANCE) == USART10_S) || \
                                                      ((INSTANCE) == USART11_NS) || ((INSTANCE) == USART11_S) || \
                                                      ((INSTANCE) == UART12_NS)  || ((INSTANCE) == UART12_S)  || \
                                                      ((INSTANCE) == LPUART1_NS) || ((INSTANCE) == LPUART1_S))

